app/Controllers/UserController.php

    public function listUsers() {
        // Call user model and fetch all users from users table in database
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function deleteUser($id) {
        $data = array();
        if($this->request->getMethod() == 'delete'){
            $userModel = new UserModel();
            $userModel->delete($id);
            return redirect()->to('/');

        }
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);
---
DELETE FROM `users`
WHERE `user_id` IN ('4')
SELECT *
FROM `users`
WHERE `users`.`user_id` = '4'